src/Documents/гф_ДанныеЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>гф_ДанныеЗагрузки</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Интерфейс</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.гф_Интерфейсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.гф_СтатусыДокументовЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправления</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолучения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяФайла</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/гф_ДанныеЗагрузки/Forms/гф_ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриОткрытииНаСервере()
	// #wortmann { 
	// Устанавливаем отбор для РС гф_СтрокиДокументаДанныеЗагрузки по Ссылке 
	// Галфинд_Домнышева 2022/09/19
	
	ЭлементОтбора = СтрокиРС.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Документ");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	
	// } #wortmann
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// #wortmann { 
	// Вызов процедур на Сервере для контроля доступности кнопок и правильного отображения значений ТЧ 
	// Галфинд_Домнышева 2022/09/19
	ПриОткрытииНаСервере();
	ДоступностьКнопок();
	// } #wortmann
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// #wortmann { 
// Устанавливает доступность кнопок формы 
// Галфинд_Домнышева 2022/09/19
&НаКлиенте
Процедура ДоступностьКнопок() 
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 			
		СтатусЗагружено = ПолучитьСтатусДокумента();
		Если  СтатусЗагружено Тогда
			Элементы.СтрокиРС.КоманднаяПанель.ПодчиненныеЭлементы.СтрокиРСЗагрузить.Доступность 	= Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Pricat = ПолучитьИнтерфейс();
		Если Pricat Тогда
			Элементы.СтрокиРС.КоманднаяПанель.ПодчиненныеЭлементы.ОбработкаPricat.Доступность = Истина; 
		КонецЕсли;
	Иначе	
		Элементы.СтрокиРС.КоманднаяПанель.ПодчиненныеЭлементы.ОбработкаPricat.Доступность = Ложь;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры// } #wortmann

// #wortmann { 
// Функция получает реквизит СтатусДокумента и возваращает Истина или Ложь
// Галфинд_Домнышева 2022/09/19
//
// Возвращаемое значение:
//  - Булево - возвращает Истина, если найденный статусДокумента соответсвует значениям Загружено ил ЗагруженоСОшибками
&НаСервере
Функция ПолучитьСтатусДокумента()
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	гф_ДанныеЗагрузки.СтатусДокумента КАК СтатусДокумента
	 |ИЗ
	 |	Документ.гф_ДанныеЗагрузки КАК гф_ДанныеЗагрузки
	 |ГДЕ
	 |	гф_ДанныеЗагрузки.Ссылка = &Ссылка";
	 
	 Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 Выборка = РезультатЗапроса.Выбрать();
	 
	 Если Не РезультатЗапроса.Пустой() Тогда
		 Выборка.Следующий();
		 СтатусДокумента = Выборка.СтатусДокумента;
		 Если СтатусДокумента = Перечисления.гф_СтатусыДокументовЗагрузки.ЗагруженоСОшибками ИЛИ
			 СтатусДокумента = Перечисления.гф_СтатусыДокументовЗагрузки.Загружено Тогда
			 Возврат Истина;
		 Иначе
			 Возврат Ложь;
		 КонецЕсли;
	 КонецЕсли;

КонецФункции// } #wortmann

// #wortmann { 
// Функция получает реквизит Интерфейс и возваращает Истина или Ложь
// Галфинд_Домнышева 2022/09/19
//
// Возвращаемое значение:
//  - Булево - возвращает Истина, если найденный Интерфейс соответсвует значению PRICAT
&НаСервере
Функция ПолучитьИнтерфейс()
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	гф_ДанныеЗагрузки.Интерфейс КАК Интерфейс
	 |ИЗ
	 |	Документ.гф_ДанныеЗагрузки КАК гф_ДанныеЗагрузки
	 |ГДЕ
	 |	гф_ДанныеЗагрузки.Ссылка = &Ссылка";
	 
	 Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 Выборка = РезультатЗапроса.Выбрать();
	 
	 Если Не РезультатЗапроса.Пустой() Тогда
		 Выборка.Следующий();
		 Интерфейс = Выборка.Интерфейс;
		 Если Интерфейс = Перечисления.гф_Интерфейсы.PRICAT Тогда
			 Возврат Истина;
		 Иначе
			 Возврат Ложь;
		 КонецЕсли;
	 КонецЕсли;

КонецФункции// } #wortmann

#КонецОбласти
